Repository: funpayhub/funpayhub
Catalog: locales/*/LC_MESSAGES/exceptions.po
Languages: ru

source: Not enough goods in source %s. Available amount: %d. Requested: %d.
ru: Недостаточно товаров в источнике %s. Доступно: %d. Запрошено: %d.

source: Goods source %s does not exist.
ru: Источник товаров %s не найден.

source: %s already exists.
ru: %s уже существует.

source: Invalid archive structure: archive contains absolute path %s, which is not allowed. All paths must be relative.
ru: Невалидная структура архива: архив содержит абсолютный путь %s, что недопустимо. Архив должен содержать только относительные пути.

source: Invalid archive structure: the root of the ZIP must contain exactly one directory, but found a file: %s
ru: Невалидная структура архива: корень архива должен содержать исключительно 1 директорию, однако был найден файл: %s.

source: Invalid archive structure: the root directory name %s is not a valid Python identifier. It must be suitable for imports.
ru: Невалидная структура архива: название директории в корне архива (%s) не является валидным Python идентификатором. Название директории должно быть подходящим для импорта.

source: Invalid archive structure: expected all entries to be under root directory %s, but found entry %s outside of it.
ru: Невалидная структура архива: все файлы и директории должны находится в одной корневой директории (предположительно %s), однако %s находится вне ее.

source: Invalid archive structure: archive is empty.
ru: Невалидная структура архива: архив пустой.

source: Source %s is not a valid http URL.
ru: Источник %s не является валидным URL.

source: Invalid archive structure: plugin manifest is missing.
ru: Невалидная структура архива: отсутствует манифест плагина.

source: Invalid proxy URL.
ru: Невалидный URL прокси.

source: Unsupported scheme %s. Possible options: http, https, socks5.
ru: Неподдерживаемый протокол %s. Поддерживаемые протоколы: http, https, socks5.
