Repository: funpayhub/funpayhub
Catalog: locales/*/LC_MESSAGES/hub_logs.po
Languages: ru

source: Adding %s to %s.
ru: Добавляю %s в %s.

source: Ignoring %s: not a directory.
ru: Игнорирую %s: не директория.

source: Loading plugin %s.
ru: Загружаю плагин %s.

source: Loading manifest for %s.
ru: Загружаю манифест плагина %s.

source: Unable to load plugin manifest for %s. Skipping.
ru: Не удалось загрузить манифест плагина %s. Пропускаю.

source: Plugin %s is already loaded. Skipping.
ru: Плагин %s уже загружен. Пропускаю.

source: FunPay Hub version mismatch. Expected: %s. Current: %s.
ru: Несоответствие версии FunPayHub. Ожидалось: %s. Текущая: %s.

source: Plugin %s is disabled. Skipping.
ru: Плагин %s отключен. Пропускаю.

source: Loading entry point %s of %s.
ru: Загружаю точку входа %s плагина %s.

source: Plugin %s does not have a locales path. Skipping locales installation.
ru: У плагина %s не указан путь до локалей. Пропускаю установку локалей.

source: Loading locales for plugin %s.
ru: Загружаю локали плагина %s.

source: Unable to load locales for plugin %s. This will not stop plugin from setting up.
ru: Не удалось загрузить локали плагина %s. Это не остановит загрузку плагина.

source: Plugin %s does not have a plugin instance. Skipping step %s.
ru: Плагин %s не инстанцирован. Пропускаю этап %s.

source: Running %s step for plugin %s.
ru: Выполняю этап %s для плагина %s.

source: Installing plugin from source %s ...
ru: Устанавливаю плагин из источника %s ...

source: Failed to install plugin from source %s.
ru: Не удалось устоановить плагин из источника %s.

source: An 429 error occurred while raising offers of category %s. Waiting for %d seconds.
ru: Произошла ошибка 429 при поднятии лотов категории %s. Ожидаю %d секунд.

source: Offer raiser loop for category %s has been started.
ru: Цикл поднятия лотов категории %s запущен.

source: Offers of category %s has been raised. Next try in %d.
ru: Лоты категории %s подняты. Следующая попытка через %d.

source: Unable to raise offers of category %s: not authorized.
ru: Не удалось поднять лоты категории %s: не авторизирован.

source: Unable to raise offers of category %s: need to wait for %d.
ru: Не удалось поднять лоты категории %s: необходимо подождать %d.

source: A Server error occurred while raising offers of category %s.
ru: Произошла серверная ошибка при поднятии лотов категории %s.

source: An unexpected error occurred while raising offers of category %s.
ru: Произошла неожиданная ошибка при поднятии лотов категории %s.

source: Offer raising loop of category %s has been stopped.
ru: Цикл поднятия лотов категории %s остановлен.

source: Offer raising loop task of category %s (%s) has been removed from manager.
ru: Таска цикла поднятия лотов категории %s (%s) удалена из менеджера.

source: Offer raising loop task of category %s (%s) has not been found in manager.
ru: Таска цикла поднятия лотов категории %s (%s) не найдена.

source: Fetching releases...
ru: Запрашиваю данные о релизах...

source: An error occurred while fetching releases.
ru: Произошла ошибка при запросе данных о релизах.

source: No releases available.
ru: Установлена последняя версия FunPay Hub.

source: New release %s available.
ru: Доступен новый релиз %s.

source: Downloading update from %s
ru: Загружаю обновление из %s

source: Unexpected status code while downloading update: %d.
ru: Получен неожиданный статус код при загрузке обновления: %d.

source: Timeout error while downloading updated.
ru: Таймаут скачивания обновления.

source: Unexpected error while downloading an updated.
ru: Произошла неожиданная ошибка при скачивании обновления.

source: Installing update to %s ...
ru: Устанавливаю обновление %s ...

source: Unexpected error while installing update to %s.
ru: Произошла неожиданная ошибка при установке обновления %s.

source: Adding menu builder %s to registry...
ru: Добавляю меню %s в реестр.

source: Menu %s not found.
ru: Меню %s не найдено.

source: Building menu %s.
ru: Выполняю построение меню %s.

source: Adding button builder %s to registry...
ru: Добавляю кнопку %s в реестр.

source: Modification %s for button %s has been added to registry.
ru: Модификатор %s для кнопки %s добавлен в реестр.

source: Button %s not found.
ru: Кнопка %s не найдена.

source: Building button %s.
ru: Выполняю построение кнопки %s.
