Repository: funpayhub/funpayhub
Catalog: locales/*/LC_MESSAGES/main.po
Languages: ru

source: DBUG
ru: ДБАГ

source: INFO
ru: ИНФО

source: WARN
ru: ПРЕД

source: ERRR
ru: ОШИБ

source: CRIT
ru: КРИТ

source: Fetching releases...
ru: Получение списка релизов...

source: An error occurred while fetching releases.
ru: Произошла ошибка при получении релизов.

source: No releases available.
ru: Релизы недоступны.

source: New release %s available.
ru: Доступен новый релиз %s.

source: Downloading update from %s
ru: Скачивание обновления с %s

source: Unexpected status code while downloading update: %d.
ru: Неожиданный код статуса при скачивании обновления: %d.

source: Timeout error while downloading updated.
ru: Ошибка таймаута при скачивании обновления.

source: Unexpected error while downloading an updated.
ru: Неожиданная ошибка при скачивании обновления.

source: Installing update to %s ...
ru: Установка обновления в %s ...

source: Unexpected error while installing update to %s.
ru: Неожиданная ошибка при установке обновления в %s.

source: Shutting down FunPayHub with exit code %d.
ru: Завершение работы FunPayHub с кодом выхода %d.

source: Trying to make a first request to FunPay...
ru: Попытка выполнить первый запрос к FunPay...

source: An error occurred while making first request to FunPay: unauthenticated.
ru: Ошибка при выполнении первого запроса к FunPay: неаутентифицировано.

source: An error occurred while making first request to FunPay: rate limit exceeded. Retrying in 5 seconds.
ru: Ошибка при выполнении первого запроса к FunPay: превышен лимит запросов. Повтор через 5 секунд.

source: An error occurred while making first request to FunPay: FunPay server error. Retrying in 5 seconds.
ru: Ошибка при выполнении первого запроса к FunPay: ошибка сервера FunPay. Повтор через 5 секунд.

source: An error occurred while making first request to FunPay.
ru: Произошла ошибка при выполнении первого запроса к FunPay.

source: Failed to make first request to FunPay.
ru: Не удалось выполнить первый запрос к FunPay.

source: Unable to send message.
ru: Не удалось отправить сообщение.

source: Unable to send message to %s.
ru: Не удалось отправить сообщение пользователю %s.

source: Unable to send message to %s. Attempts exceeded.
ru: Не удалось отправить сообщение пользователю %s. Превышено количество попыток.

source: An 429 error occurred while raising offers of category %s. Waiting for %d seconds.
ru: Произошла ошибка 429 при поднятии предложений категории %s. Ожидание %d секунд.

source: Offer raiser loop for category %s has been started.
ru: Цикл поднятия предложений для категории %s запущен.

source: Offers of category %s has been raised. Next try in %d.
ru: Предложения категории %s подняты. Следующая попытка через %d.

source: Unable to raise offers of category %s: not authorized.
ru: Не удалось поднять предложения категории %s: нет авторизации.

source: Unable to raise offers of category %s: need to wait for %d.
ru: Не удалось поднять предложения категории %s: нужно подождать %d.

source: A Server error occurred while raising offers of category %s.
ru: Произошла ошибка сервера при поднятии предложений категории %s.

source: An unexpected error occurred while raising offers of category %s.
ru: Произошла неожиданная ошибка при поднятии предложений категории %s.

source: Offer raising loop of category %s has been stopped.
ru: Цикл поднятия предложений категории %s остановлен.

source: Offer raising loop task of category %s (%s) has been removed from manager.
ru: Задача цикла поднятия предложений категории %s (%s) удалена из менеджера.

source: Offer raising loop task of category %s (%s) has not been found in manager.
ru: Задача цикла поднятия предложений категории %s (%s) не найдена в менеджере.

source: Caught an error!
ru: Произошла ошибка!

source: Unpacked callback data: %s Callback: %s Data: %s History: %s
ru: Распакованные данные callback: %s Callback: %s Данные: %s История: %s

source: App initialized. Version: %s. Instance ID: %s
ru: Приложение инициализировано. Версия: %s. ID экземпляра: %s

source: Failed to load plugins. Creating crashlog.
ru: Не удалось загрузить плагины. Создаётся отчет о сбое.

source: Loading goods files.
ru: Загрузка файлов товаров.

source: Loading goods file %s.
ru: Загрузка файла товаров %s.

source: An error occurred while loading goods file %s: %s
ru: Ошибка при загрузке файла товаров %s: %s

source: Button builder %s assigned as button builder for entries of type %s.
ru: Билдер кнопок %s назначен как билдер для элементов типа %s.

source: Menu builder %s assigned as menu builder for entries of type %r.
ru: Билдер меню %s назначен как билдер для элементов типа %r.

source: Not enough goods in source %s. Available amount: %d. Requested: %d.
ru: Недостаточно товаров в источнике %s. Доступно: %d. Запрошено: %d.

source: Goods source %s does not exist.
ru: Источник товаров %s не существует.

source: Plugin repository %s already exist.
ru: Репозиторий плагинов %s уже существует.

source: Invalid plugin repository.
ru: Недействительный репозиторий плагинов.

source: Unable to save repository %s to %s.
ru: Не удалось сохранить репозиторий %s в %s.

source: Unable to remove repository %s. (file: %s).
ru: Не удалось удалить репозиторий %s. (файл: %s).

source: Installing plugin from source %s ...
ru: Установка плагина из источника %s ...

source: Failed to install plugin from source %s.
ru: Не удалось установить плагин из источника %s.

source: See logs.
ru: Смотрите логи.

source: Invalid archive structure: archive contains absolute path %s, which is not allowed. All paths must be relative.
ru: Недопустимая структура архива: архив содержит абсолютный путь %s, что запрещено. Все пути должны быть относительными.

source: Invalid archive structure: the root of the ZIP must contain exactly one directory, but found a file: %s
ru: Недопустимая структура архива: корень ZIP должен содержать ровно одну директорию, но найден файл: %s

source: Invalid archive structure: the root directory name %s is not a valid Python identifier. It must be suitable for imports.
ru: Недопустимая структура архива: имя корневой директории %s не является допустимым идентификатором Python. Оно должно подходить для импортов.

source: Invalid archive structure: expected all entries to be under root directory %s, but found entry %s outside of it.
ru: Недопустимая структура архива: ожидалось, что все элементы будут находиться в корневой директории %s, но найден элемент %s вне её.

source: Invalid archive structure: archive is empty.
ru: Недопустимая структура архива: архив пуст.

source: Invalid archive structure: plugin manifest is missing.
ru: Недопустимая структура архива: отсутствует манифест плагина.

source: Source %s is not a valid http URL.
ru: Источник %s не является допустимым HTTP URL.

source: Adding %s to sys.path.
ru: Добавление %s в sys.path.

source: Loading plugins...
ru: Загрузка плагинов...

source: Checking %s...
ru: Проверка %s...

source: Ignoring %s: not a directory.
ru: Игнорируется %s: это не директория.

source: Loading plugin %s...
ru: Загрузка плагина %s...

source: Ignoring %s: not a valid plugin directory.
ru: Игнорируется %s: недействительная директория плагина.

source: Loading plugin manifest from %s.
ru: Загрузка манифеста плагина из %s.

source: Unable to load plugin manifest for %s. Skipping.
ru: Не удалось загрузить манифест плагина для %s. Пропуск.

source: Plugin %s already loaded. Skipping.
ru: Плагин %s уже загружен. Пропуск.

source: Instantiation for this plugin disabled.
ru: Создание экземпляра для этого плагина отключено.

source: App version mismatch. Plugin requires: %s. Current: %s.
ru: Несовпадение версии приложения. Плагин требует: %s. Текущая: %s.

source: Loading entry point %s of %s.
ru: Загрузка точки входа %s из %s.

source: An error occurred while loading entry point %s of %s.
ru: Произошла ошибка при загрузке точки входа %s из %s.

source: An unexpected error occurred while instantiating plugin %s. See logs.
ru: Произошла неожиданная ошибка при создании плагина %s. Смотрите логи.

source: Step %s is not in plugin manager. Skipping.
ru: Шаг %s отсутствует в менеджере плагинов. Пропуск.

source: Plugin %s does not have a plugin instance. Skipping step %s.
ru: Плагин %s не имеет экземпляра. Пропуск шага %s.

source: Running %s step for plugin %s.
ru: Выполнение шага %s для плагина %s.

source: Unable to find entry point %s of %s.
ru: Не удалось найти точку входа %s из %s.

source: Entry point of plugin must be a subclass of %s, not %s.
ru: Точка входа плагина должна быть подклассом %s, а не %s.

source: Unable to load repository: invalid format.
ru: Не удалось загрузить репозиторий: неверный формат.

source: Unable to load repository: JSON decode error.
ru: Не удалось загрузить репозиторий: ошибка декодирования JSON.

source: Unable to load repository: %s does not exist.
ru: Не удалось загрузить репозиторий: %s не существует.

source: Unable to load repository: unable to read %s.
ru: Не удалось загрузить репозиторий: невозможно прочитать %s.

source: Unable to load repository: download timed out.
ru: Не удалось загрузить репозиторий: превышено время ожидания скачивания.

source: Unable to load repository: unexpected error while downloading.
ru: Не удалось загрузить репозиторий: неожиданная ошибка при скачивании.

source: Loading plugins repositories from %s...
ru: Загрузка репозиториев плагинов из %s...

source: %s is a directory. Skipping.
ru: %s — это директория. Пропуск.

source: %s is not a JSON file. Skipping.
ru: %s не является JSON-файлом. Пропуск.

source: Loading plugins repository from %s...
ru: Загрузка репозитория плагинов из %s...

source: Repository ID %s does not match repo file %s. Skipping.
ru: ID репозитория %s не соответствует файлу %s. Пропуск.

source: An error occurred while loading plugin repository from %s.
ru: Произошла ошибка при загрузке репозитория плагинов из %s.

source: An error occurred while executing %s trigger for %s
ru: Произошла ошибка при выполнении триггера %s для %s

source: Adding menu builder %s to registry...
ru: Добавление билдера меню %s в реестр...

source: Menu %s not found.
ru: Меню %s не найдено.

source: Building menu %s.
ru: Построение меню %s.

source: Adding button builder %s to registry...
ru: Добавление билдера кнопок %s в реестр...

source: Modification %s for button %s has been added to registry.
ru: Модификация %s для кнопки %s добавлена в реестр.

source: Button %s not found.
ru: Кнопка %s не найдена.

source: Building button %s.
ru: Построение кнопки %s.
