Repository: funpayhub/funpayhub
Catalog: funpayhub/locales/*/LC_MESSAGES/main.po
Languages: ru

# $props:name
source: Settings
ru: ⚙️ Настройки

# $props:description
source: Settings root section
ru: Корневой раздел настроек FunPay Hub.

# $props.general:name
source: General
ru: 🔧 Общие

source: $props.general:description
ru: __empty__

# $props.general.language:name
source: Language
ru: 🌎 Язык

source: $props.general.language:description
ru: __empty__

# $props.telegram:name
source: Telegram bot settings
ru: 🔷 Настройки Telegram бота

source: $props.telegram:description
ru: __empty__

# $props.telegram.general:name
source: General
ru: 🔧 Общие

source: $props.telegram.general:description
ru: __empty__

# $props.telegram.general.token:name
source: Bot token
ru: 🔑 Токен

source: $props.telegram.general.token:description
ru: __empty__

# $props.telegram.general.password:name
source: Bot password
ru: 🔑 Пароль

source: $props.telegram.general.password:description
ru: Пароль от Telegram панели управления FunPayHub.

# $props.telegram.appearance:name
source: Appearance
ru: 🎨 Внешний вид

# $props.telegram.appearance:description
source: Telegram bot appearance settings.
ru: Настройки внешнего вида Telegram бота.

# $props.telegram.appearance.menu_entries_amount:name
source: Elements per page amount
ru: 📋 Кол-во элементов на странице

source: $props.telegram.appearance.menu_entries_amount:description
ru: Максимальное кол-во элементов на 1 странице Telegam меню. Кнопки навигации не учитываются.

# $props.auto_delivery:name
source: Autodelivery settings
ru: 📦 Настройки автовыдачи

source: $props.auto_delivery:description
ru: __empty__

# $props.auto_delivery.*.auto_delivery:name
source: Autodelivery
ru: Автовыдача

source: $props.auto_delivery.*.auto_delivery:description
ru: __empty__

# $props.auto_delivery.*.multi_delivery:name
source: Multidelivery
ru: Определять к-во товара

source: $props.auto_delivery.*.multi_delivery:description
ru: __empty__

# $props.auto_delivery.*.products_file:name
source: Goods file
ru: 🗃️ Товарный файл

source: $props.auto_delivery.*.products_file:description
ru: __empty__

# $props.auto_delivery.*.delivery_text:name
source: Delivery text
ru: Текст выдачи

source: $props.auto_delivery.*.delivery_text:description
ru: __empty__
